#include <stdio.h>
#include "auxiliar.h"

void pausar() {
    printf("\nPresiona Enter para continuar...");
    limpiarBuffer();
    getchar();
}

void limpiarBuffer() {
    int c;
    while ((c = getchar()) != '\n' && c != EOF);
}

void mostrarBanner() {
    printf("\n");
    printf("  ███████╗███████╗██╗    ███████╗███████╗ ██████╗ █████╗ ██████╗ ███████╗\n");
    printf("  ██╔════╝██╔════╝██║    ██╔════╝██╔════╝██╔════╝██╔══██╗██╔══██╗██╔════╝\n");
    printf("  █████╗  ███████╗██║    █████╗  ███████╗██║     ███████║██████╔╝█████╗  \n");
    printf("  ██╔══╝  ╚════██║██║    ██╔══╝  ╚════██║██║     ██╔══██║██╔═══╝ ██╔══╝  \n");
    printf("  ███████╗███████║██║    ███████╗███████║╚██████╗██║  ██║██║     ███████╗\n");
    printf("  ╚══════╝╚══════╝╚═╝    ╚══════╝╚══════╝ ╚═════╝╚═╝  ╚═╝╚═╝     ╚══════╝\n");
    printf("\n");
    printf("                    >>>   ¿SERAS CAPAZ DE ESCAPAR?   <<<                 \n");
    printf("\n");
}
